[
    {
        "title": "Texas assistant principal left blinded, may lose eye after ‘aggressive’ student threw hanger at her: ‘Knocked it out of the socket’",
        "order": 20240827,
        "author": "Jamon Clayton, D.C.",
        "authorDetails": "Chiropractor/ Owner at J5 Chiropractic and Health Centers, Designated Doctor in the State of Texas",
        "text": "First, let's define what a PI Mill is. It's usually a combination of a law firm that puts several personal injury cases into the hands of individual case managers, while the patients are being treated for their injuries at high volume personal injury clinics where the treatment is mostly the same for everyone regardless of the type of injury. Let me repeat that last statement, the treatment is the same for everyone regardless of the type of injury.  For example, a person with an elbow contusion (who under normal circumstances should heal within 10 visits maximum) is getting the same number of treatments as someone with a torn rotator cuff tendon. Medically, it makes no sense, but it's also costing the patients as far as their settlement, especially over the long term use of this practice.//Let's understand the role of the law firm in a patient's case involving personal injury. It would be to research and discover all evidence needed to help maximize a claim. That includes securing the police report, car damage estimates, pictures of the scene and injuries, witness statements, car insurance policies, and any other pertinent information to best benefit a patient's case; then present this information to the insurance adjuster to negotiate a good settlement. A PI mill law firm misses the boat on many of the things I just mentioned and on occasion they may even lose some of the things i just mentioned after they receieve them. This is because many PI mill law firms have individual case managers trying to balance 50 to 100 cases at once. This is why they don't answer your phone calls, don't remember specifics about your case, and don't call you back when you leave messages. This is poor professional and customer service to say the least. If any other business treated you this way you would never use their services, but many PI firms, for now, are able to get away with this.//Let's discuss the case managers. They are put in a very precarious position on many fronts. They are usually overworked, with too many cases, along with being underpaid. This leads to a lot of negativity and friction between the case manager and the patients whose cases they are trying to manage. They also are the ones usually approving MRIs, CT scans and other referrals sent by doctors under the guidance of LOPs (letter of protections). As one can imagine this presents a big problem. How are they able to manage cases along with approving referral tests accurately, especially if they don't understand anything medically about injuries? This kind of problem leads to many delays in proper referrals and the improper approvals of medically unnecessary tests and treatment as well. Both of these can negatively affect a patients case.//The PI mill clinics are usually no better. The doctors or other therapists are trying to treat 50-100 plus patients by themselves while examining new patients in between. Just like case managers in a PI law firm, the doctors and therapists are usually underpaid and overworked. Whenever you have overworked doctors, the number of mistakes in care goes up tremendously. Tired doctors often misdiagnose, mistreat, and give sub standard care. If you are wondering how you never got better from your car accident, this may be the primary reason. After all, if you are going to a PI mill for treatment, you probably got the same care as someone with a completely different injury. This is equivalent to a surgeon doing the same type of surgery for someone with a torn meniscus, as oppossed to a torn ACL.//How does all of this affect the outcome of a case one may ask? By having several misdiagnosed patients along with case managers mismanaging cases, it greatly diminishes cases and their potential to maximize claims. If doctors are taking MRIs on regions where the examinations and symptoms don't warrant it, but missing on areas where an examination and symptoms do warrant it, then tens of thousands of dollars on settlements will be missed. This happens quite often.//My tip for PI mills is to change this practice, as the new generation of patients do not and will not tolerate poor medical treatment, poor communication and poor customer service. PI mill law firms need the lawyers more involved in the cases and case managers need less work loads ( a maximum of 25 cases per person). PI mill clinics need more doctors present for treatment and a better individualized plan of care for each patient to maximize their recovery as well as their case. Without these changes taking place, PI mills are taking the chance of getting run out of town by law firms and clinics who provide better professional and customer services, which ultimately result in more favorable reviews and higher settlements.",
        "externalArticle": "https://nypost.com/2024/08/27/us-news/texas-assistant-principal-left-blinded-may-lose-eye-after-student-threw-hanger-at-her/",
        "pictureURL": "https://nypost.com/wp-content/uploads/sites/2/2024/08/khou-88382431.jpg?resize=1024,682&quality=75&strip=all",
        "articleID": "1"
    },
    {
        "title": "Musk's SpaceX sued for negligence in accident that led to worker's coma",
        "order": 20240126,
        "author": "Jamon Clayton, D.C.",
        "authorDetails": "Chiropractor/ Owner at J5 Chiropractic and Health Centers, Designated Doctor in the State of Texas",
        "text": "If you have ever been in a car accident, whether you hired a lawyer or not, the term “property damage” has certainly come up in a conversation  at one time or another. In a car accident, this term describes the likely cost to repair or fix a vehicle. For instance, if the estimated cost to fix the back bumper of a vehicle is $2000, then the property damage (also sometimes referred to as PD) would be $2000. Some lawyers or case managers for lawyers will not even take some personal injury cases depending on  the extent of the property damage. This is because property damage, rather than extent of personal injury, has become the single biggest factor in determining  injury settlement amounts. This, in so many ways, goes against the benefit of a patient and more importantly against medical knowledge.//Extent of  Personal Injury means the mechanism of how a person got injured or hurt. In other words, what torsions, rotations, bendings, etc., happened during the moment of impact that would cause a person’s body to get hurt significant enough to cause injury. The answer to this question is very complicated, even for a licensed medical professional such as myself. Certainly, a lawyer, case manager or adjuster would not know or ever completely understand mechanism or extent of injury. This is probably why they  avoid the personal injury argument and focus their concerns on property damage.//Currently, most personal injury cases work something like this. The attorney argues with an insurance company that their client should be compensated well because of a high PD (property damage) value. The insurance company eventually gives in because they also assume that high PD equates to more body damage or personal injury. This could also work the other way, when the PD is low. The attorney will assume the insurance will not pay much, therefore usually settling for much lower amounts. This current way of determining compensation for patients has to change. The current system belittles the patients and often assumes that extent or mechanism of injury does not even exist.//It’s important to note  that car crashes can happen in many ways and directions. Many factors can influence property damage. A truck hitting a car will usually cause more damage than a car hitting a car. An 18 Wheeler may total a car going at 15 miles per hour, whereas a car going at that very same speed may leave just $300 worth of damage. Older model cars are heavier and therefore can take more damage. Newer model cars are lighter and easier to damage. More expensive cars cost more for repairs. Older inexpensive cars may be worth more to just total it out rather than find the parts for fixing them. Side and front impacts are harder to fix. Rear impacts are easier to fix. Some cars have good bumpers that absorb impacts well and leave little signs of damage. Some cars don’t have that technology. Some cities and counties charge more for doing mechanic work. Some cities charge less.//Let me discuss further the topic of understanding extent of injury. As a designated doctor in the state of Texas, I determine extent of injury in complicated worker’s compensation cases. For example, I may have to determine if a worker could get a disc bulge by bending down and lifting over 50 pounds of material; If a person may need surgery to fix a problem that has not been resolved; A decent amount of time a person may need to be off work from an injury, if they have a job that is physically demanding; If falling down on the wrists can cause Carpal Tunnel Syndrome. Most importantly though, is determining the possible long term implications a person may have from an injury. All of these examples in some way relate to understanding extent and mechanism of injury, and therefore I judge them on a case by case basis. As a doctor, the possible cost of services,  where the injury happened, or the company involved of where an injury happened, does not and should not affect my opinion in determining the patient’s actual injury.//Let’s break down a case from a medical knowledge perspective.  A 42 year old patient develops a low back disc bulge in a car accident, in which the patient was side impacted by a car going 30 miles per hour. Medical research shows that low back disc bulges can happen from a single impact accident, but this is usually a rare occurrence. Low back disc bulges most usually occur with a lifting mechanism, in which a person is bending or flexed over and usually while carrying or lifting a load. Is a person lifting a load in a car accident? No. Is the person bending over or flexed over while driving? Driving does usually require the spine to be in slight flexion, but not to a great extent. So, then the question remains; Is a disc bulge likely to happen in this scenario, or could the patient have already had an asymptomatic low back disc bulge that was aggravated in the accident, therefore causing pain? The answer to these questions would come from the patient’s history, a physical examination, and pertinent questions pertaining to the moment of impact in the accident.//When a personal injury case is analyzed properly, it is easy to see why property damage should have little impact on determining the outcome of a personal injury case. The actual injury should be the focus. This would of course require a new paradigm of thinking that would involve attorneys, case managers, doctors, adjusters, and all others involved in the personal injury industry. But for now, PD rules. Not the police department here, but property damage.",
        "externalArticle": "https://www.reuters.com/legal/musks-spacex-sued-negligence-accident-that-led-workers-coma-2024-01-26/",
        "pictureURL": "https://www.reuters.com/resizer/v2/U6I5BLBYZZO75LK5B77A6QWYLA.jpg?auth=58acc08b8868ddc45553d83d3009827e43362d849bd21194ec71d816f04835d2&width=640&quality=80",
        "articleID": "2"
    },
    {
        "title": "Woman killed in forklift accident at Fort Worth Walmart distribution center",
        "order": 20240216,
        "author": "Jamon Clayton, D.C.",
        "authorDetails": "Chiropractor/ Owner at J5 Chiropractic and Health Centers, Designated Doctor in the State of Texas",
        "text": "The steps to reporting and responding to a personal injury immediately after an accident are so important that they cannot be stated enough. This is considering, you are not knocked unconscious and transmitted to a hospital from the accident itself. A claims adjuster will usually try to use the initial missteps against you when resolving a claim from an accident. Following the steps below will make your claim much easier, and will immediately determine the liability of the other party involved.//TAKE PICTURES.]]//You don’t have to be a photographer to use the phones of today, as today’s technology makes it extremely easy to take photos of a scene. Today’s phones allow you to take up to 20 photos in a span of one minute. Possibly, even more. Take photos of your injuries if there are obvious bruises or swelling. Take photos of the scene. If from a motor vehicle accident, take photos of the car damage (all vehicles involved if possible). If from a slip and fall, take photos of where the fall happened and the area surrounding the fall. Photos of a scene are akin to finding a knife or gun in a murder investigation. A photo itself can possibly seal the deal in some personal injury cases.//RECORD THE SCENE ON VIDEO.]]//If you do not have a video recorder on your phone, I suggest you to make your way to a phone store now to purchase a phone with one. Video evidence is a way of recapturing the scene and responses live and can be used too as evidence in a personal injury matter.//RECORD THE SCENE OR OTHER PARTY ON AUDIO.]]//Audio recordings are of utmost importance when trying to determine liability. Most people will not admit fault after the accident has happened, but most will admit fault on the scene. If you have the audio recording of them admitting fault, it eliminates the insurance carrier trying to deny liability and eliminates the credibility of the other party lying about fault later on.//SEEK MEDICAL TREATMENT WITHIN A WEEK OF THE ACCIDENT.]]//Even if your pains are minor and your body feels normal, seek medical treatment for an actual evaluation and diagnosis. If a Doctor can provide a diagnosis, then treatment can be made if necessary, even if it’s at a later time. It’s important to also understand that symptoms may arise later on, days after an accident, so not having excruciating pain should not discourage you from being checked out by a Doctor.//Many patient’s worry about how the medical facility will “take all of my settlement money”, and therefore do not seek treatment. I’ve heard this fear many times, and still don’t quite understand it. Of course, it could be because there are clinics out there that give everyone the same kind of treatment regardless of injury, and run you in and out for 40 visits. It’s what’s known as a personal injury mill. They should be avoided, and every patient should seek out a reputable clinic for proper treatment. The fact remains though, unless you are in a coma at a hospital for days or weeks, there really isn’t a possibility of a medical facility taking a significant portion of settlement money.//USE COMMON SENSE WITH YOUR CLAIMS ADJUSTER.]]//There is a reason they are called claims adjusters. The adjuster sees your claim and now wants to “adjust” it to the benefit of the insurance company. Only speak briefly with them, acknowledging an accident has taken place and refer to the police report as far as any specifics about the accident. No need to talk about any other matters, such as work, car payments, insurance payments, what lawyer you may have, who you know, previous accidents you have been in, your medical history and so on.//WAIT FOR POLICE TO ARRIVE]]//This may not be the best option for anyone with outstanding warrants, but a police report is usually of importance in proving that you are not liable for the accident. The problem with waiting for police to arrive is that there usually is no urgency for police to simply come and write a police report. Therefore, the wait maybe an hour or two, or longer. In fact, police usually only arrives within a reasonable amount of time if someone is badly injured or if someone needs to be taken to a hospital by ambulance.//CONCLUSION]]//Following these steps will facilitate an easier resolution of your personal injury case. The content of this article is for informational purposes only. Please refer to a lawyer on specific advice on how to handle personal injury claims after an accident.",
        "externalArticle": "https://www.nbcdfw.com/news/local/woman-killed-in-forklift-accident-at-fort-worth-walmart-distribution-center/3464521/",
        "articleID": "3"
    },
    {
        "title": "Lake Zurich roofing contractor continues to ignore safety regulations, exposing workers to deadly fall hazards in 8 inspections since 2020",
        "order": 20241204,
        "author": "Jamon Clayton, D.C.",
        "authorDetails": "Chiropractor/ Owner at J5 Chiropractic and Health Centers, Designated Doctor in the State of Texas",
        "text": "The steps to reporting and responding to a personal injury immediately after an accident are so important that they cannot be stated enough. This is considering, you are not knocked unconscious and transmitted to a hospital from the accident itself. A claims adjuster will usually try to use the initial missteps against you when resolving a claim from an accident. Following the steps below will make your claim much easier, and will immediately determine the liability of the other party involved.//TAKE PICTURES.]]//You don’t have to be a photographer to use the phones of today, as today’s technology makes it extremely easy to take photos of a scene. Today’s phones allow you to take up to 20 photos in a span of one minute. Possibly, even more. Take photos of your injuries if there are obvious bruises or swelling. Take photos of the scene. If from a motor vehicle accident, take photos of the car damage (all vehicles involved if possible). If from a slip and fall, take photos of where the fall happened and the area surrounding the fall. Photos of a scene are akin to finding a knife or gun in a murder investigation. A photo itself can possibly seal the deal in some personal injury cases.//RECORD THE SCENE ON VIDEO.]]//If you do not have a video recorder on your phone, I suggest you to make your way to a phone store now to purchase a phone with one. Video evidence is a way of recapturing the scene and responses live and can be used too as evidence in a personal injury matter.//RECORD THE SCENE OR OTHER PARTY ON AUDIO.]]//Audio recordings are of utmost importance when trying to determine liability. Most people will not admit fault after the accident has happened, but most will admit fault on the scene. If you have the audio recording of them admitting fault, it eliminates the insurance carrier trying to deny liability and eliminates the credibility of the other party lying about fault later on.//SEEK MEDICAL TREATMENT WITHIN A WEEK OF THE ACCIDENT.]]//Even if your pains are minor and your body feels normal, seek medical treatment for an actual evaluation and diagnosis. If a Doctor can provide a diagnosis, then treatment can be made if necessary, even if it’s at a later time. It’s important to also understand that symptoms may arise later on, days after an accident, so not having excruciating pain should not discourage you from being checked out by a Doctor.//Many patient’s worry about how the medical facility will “take all of my settlement money”, and therefore do not seek treatment. I’ve heard this fear many times, and still don’t quite understand it. Of course, it could be because there are clinics out there that give everyone the same kind of treatment regardless of injury, and run you in and out for 40 visits. It’s what’s known as a personal injury mill. They should be avoided, and every patient should seek out a reputable clinic for proper treatment. The fact remains though, unless you are in a coma at a hospital for days or weeks, there really isn’t a possibility of a medical facility taking a significant portion of settlement money.//USE COMMON SENSE WITH YOUR CLAIMS ADJUSTER.]]//There is a reason they are called claims adjusters. The adjuster sees your claim and now wants to “adjust” it to the benefit of the insurance company. Only speak briefly with them, acknowledging an accident has taken place and refer to the police report as far as any specifics about the accident. No need to talk about any other matters, such as work, car payments, insurance payments, what lawyer you may have, who you know, previous accidents you have been in, your medical history and so on.//WAIT FOR POLICE TO ARRIVE]]//This may not be the best option for anyone with outstanding warrants, but a police report is usually of importance in proving that you are not liable for the accident. The problem with waiting for police to arrive is that there usually is no urgency for police to simply come and write a police report. Therefore, the wait maybe an hour or two, or longer. In fact, police usually only arrives within a reasonable amount of time if someone is badly injured or if someone needs to be taken to a hospital by ambulance.//CONCLUSION]]//Following these steps will facilitate an easier resolution of your personal injury case. The content of this article is for informational purposes only. Please refer to a lawyer on specific advice on how to handle personal injury claims after an accident.",
        "externalArticle": "https://www.osha.gov/news/newsreleases/chicago/20241204",
        "articleID": "4"
    },
    {
        "title": "Lake Zurich roofing contractor continues to ignore safety regulations, exposing workers to deadly fall hazards in 8 inspections since 2020",
        "order": 20241217,
        "author": "Jamon Clayton, D.C.",
        "authorDetails": "Chiropractor/ Owner at J5 Chiropractic and Health Centers, Designated Doctor in the State of Texas",
        "text": "The steps to reporting and responding to a personal injury immediately after an accident are so important that they cannot be stated enough. This is considering, you are not knocked unconscious and transmitted to a hospital from the accident itself. A claims adjuster will usually try to use the initial missteps against you when resolving a claim from an accident. Following the steps below will make your claim much easier, and will immediately determine the liability of the other party involved.//TAKE PICTURES.]]//You don’t have to be a photographer to use the phones of today, as today’s technology makes it extremely easy to take photos of a scene. Today’s phones allow you to take up to 20 photos in a span of one minute. Possibly, even more. Take photos of your injuries if there are obvious bruises or swelling. Take photos of the scene. If from a motor vehicle accident, take photos of the car damage (all vehicles involved if possible). If from a slip and fall, take photos of where the fall happened and the area surrounding the fall. Photos of a scene are akin to finding a knife or gun in a murder investigation. A photo itself can possibly seal the deal in some personal injury cases.//RECORD THE SCENE ON VIDEO.]]//If you do not have a video recorder on your phone, I suggest you to make your way to a phone store now to purchase a phone with one. Video evidence is a way of recapturing the scene and responses live and can be used too as evidence in a personal injury matter.//RECORD THE SCENE OR OTHER PARTY ON AUDIO.]]//Audio recordings are of utmost importance when trying to determine liability. Most people will not admit fault after the accident has happened, but most will admit fault on the scene. If you have the audio recording of them admitting fault, it eliminates the insurance carrier trying to deny liability and eliminates the credibility of the other party lying about fault later on.//SEEK MEDICAL TREATMENT WITHIN A WEEK OF THE ACCIDENT.]]//Even if your pains are minor and your body feels normal, seek medical treatment for an actual evaluation and diagnosis. If a Doctor can provide a diagnosis, then treatment can be made if necessary, even if it’s at a later time. It’s important to also understand that symptoms may arise later on, days after an accident, so not having excruciating pain should not discourage you from being checked out by a Doctor.//Many patient’s worry about how the medical facility will “take all of my settlement money”, and therefore do not seek treatment. I’ve heard this fear many times, and still don’t quite understand it. Of course, it could be because there are clinics out there that give everyone the same kind of treatment regardless of injury, and run you in and out for 40 visits. It’s what’s known as a personal injury mill. They should be avoided, and every patient should seek out a reputable clinic for proper treatment. The fact remains though, unless you are in a coma at a hospital for days or weeks, there really isn’t a possibility of a medical facility taking a significant portion of settlement money.//USE COMMON SENSE WITH YOUR CLAIMS ADJUSTER.]]//There is a reason they are called claims adjusters. The adjuster sees your claim and now wants to “adjust” it to the benefit of the insurance company. Only speak briefly with them, acknowledging an accident has taken place and refer to the police report as far as any specifics about the accident. No need to talk about any other matters, such as work, car payments, insurance payments, what lawyer you may have, who you know, previous accidents you have been in, your medical history and so on.//WAIT FOR POLICE TO ARRIVE]]//This may not be the best option for anyone with outstanding warrants, but a police report is usually of importance in proving that you are not liable for the accident. The problem with waiting for police to arrive is that there usually is no urgency for police to simply come and write a police report. Therefore, the wait maybe an hour or two, or longer. In fact, police usually only arrives within a reasonable amount of time if someone is badly injured or if someone needs to be taken to a hospital by ambulance.//CONCLUSION]]//Following these steps will facilitate an easier resolution of your personal injury case. The content of this article is for informational purposes only. Please refer to a lawyer on specific advice on how to handle personal injury claims after an accident.",
        "externalArticle": "https://apnews.com/article/jailer-killed-texas-inmate-791940bede59ef79366df6c9af9e33b9",
        "articleID": "5"
    }
]
