{
    "text": "What is an Impairment Rating (IR)?]]//\nAn impairment rating (IR) is considered a permanent disability rating and is used to assess the degree of damage that resulted from your work-related injury or occupational disease. A permanent disability rating, sometimes known as a permanent impairment rating, is an assessment of the severity of your permanent impairment.\nAccording to the AMA Guides, impairments that are to be rated are permanent impairments. A permanent impairment is defined as one that has reached maximum medical improvement (MMI) and is well stabilized and unlikely to change substantially in the next year with or without medical treatment.//\nAn IR is dictated by Section 408.123 of the Texas Labor Code. It reads as follows://\nAfter an employee has been certified by a doctor as having reached Maximum Medical Improvement, the certifying doctor shall evaluate the condition of the employee and assign an impairment rating using the impairment rating guidelines described by Section 408.124. If the certification and evaluation are performed by a doctor other than the employee’s treating doctor, the certification and evaluation shall be submitted to the treating doctor, and the treating doctor shall indicate agreement or disagreement with the certification and evaluation.//\nWhat is Maximum Medical Improvement (MMI)?]]//\nThe concept of Maximum Medical Improvement (MMI) is one of the most difficult issues to address in workers' compensation. Subsequent questions have been raised as to the continuation of monetary benefit and future medical care of the injured worker. The amount of “fair” compensation is a major bone of contention.//\nWhat is an Alternative Impairment Rating (AIR)?]]//\nWe offer Alternate Impairment Rating (AIR) services for referring doctors so they can ensure that their patients receive unbiased and accurate ratings by Designated Doctors. We analyze each report and have the knowledge and experience to critique reports so that an accurate impairment is provided.//\nWhat is a Functional Capacity Evaluation (FCE)?]]//\nA functional capacity evaluation (FCE) evaluates an individual's capacity to perform work activities related to his or her participation in employment (Soer et al., 2008). The FCE process compares the individual's health status, and body functions and structures to the demands of the job and the work environment. In essence, an FCE's primary purpose is to evaluate a person's ability to participate in work, although other instrumental activities of daily living that support work performance may also be evaluated. Similar types of testing may also be called a functional capacity assessment (FCA), physical capacity assessment or evaluation (PCA or PCE), or work capacity assessment or evaluation (WCA or WCE). A well-designed FCE should consist of a battery of standardized assessments that offers results in performance-based measures and demonstrates predictive value about the individual's return to work (Kuijer et al., 2011; Soer, et al., 2008).//\nTraditionally, FCEs measured an individual's ability to perform the physical demands of a job, but over the last decade many FCE batteries have begun to include evaluation of cognitive demands if such testing is warranted. The FCE must be administered with care for the client's safety and well-being.\nThe (FCE) is a series of tests, practices and observations that are combined to determine the ability of the evaluated person to function in a variety of circumstances, most often employment, in an objective manner.//\nPhysicians use FCE's to verify treatment protocols or return to work status and sometimes even change diagnoses based on FCEs.//\nA more focused type of FCE is a Physical Performance Evaluation (PPE) which provides a portion of the data provided by an FCE.//\nAn alternate form of the FCE is a Functional Assessment (FA) which is provided for PI claims.//\nWho Can Benefit From an FCE?//\nSomeone who has been injured on the job to determine his or her ability to return to the job or alternate work//\nSomeone applying for Social Security Disability benefits//\nSomeone seeking to return to work or volunteer activities after an injury or illness//\nSomeone injured in a catastrophic accident (i.e., automobile accident) for whom an FCE can determine performance skills and abilities related to resuming former employment or a new job//\nSomeone seeking vocational rehabilitation services//\nStudents receiving transitional services from school to the work setting to determine their skills and the extent of support required to perform in a job//\n\nEvaluator's Role in FCEs//\nThe ability to analyze an activity in detail to determine the necessary components to perform the task competently is a unique core skill of most musculo-skeletal evaluator's who perform FCE's, based on their education and training. FCEs typically require the evaluator to determine the worker's capability to perform various work-related tasks and whether there is a match between these abilities and the essential job performance components. Various practitioners from different disciplines can be involved in FCEs, such as: medical doctors, osteopaths, chiropractors, physical therapists, and occupational therapists - each bringing their unique knowledge and skills related to the complex and dynamic interactions between the person, the environment, and the occupation.//\nThe FCE may be used to determine:\n\nGoals for rehabilitation or readiness for discharge planning//\nAbility to safely return to work status (including full duty, modified duty, or transitional duty)//\nWork ability status for vocational rehabilitation//\nWorkers' compensation case settlement//\nDisability status//\nAbility to meet job demands as part of a hiring process (pre-work/post-offer employment testing)//\nAbility to meet the demands of other activities (i.e., being a student, volunteering)//\n\nWhat Are the Components of the FCE?//\nThe components of the FCE will vary based on the purpose of the assessment. The FCE typically begins with a client interview, medical record review, and musculoskeletal screening. Functional testing may include graded material-handling activities such as lifting, carrying, pushing, and pulling; and positional tolerance activities such as sitting, standing, walking, balancing, reaching, stooping, kneeling, crouching, crawling, object handling/manipulation, fingering, hand grasping, and hand manipulation. Pain monitoring is frequently performed during the FCE to document client-reported levels of pain during various activities as well as to manage pain. The FCE may also include evaluation of an individual's hand dexterity, hand coordination, endurance, and other job-specific functions.//\nThe FCE report includes an overall physical demand level (U.S. Department of Labor, n.d.), a summary of job-specific physical abilities, a summary of performance consistency and overall voluntary effort, job match information, adaptations to enhance performance, and treatment recommendations, if requested. Some FCEs are designed to also report on the worker's ability to meet the cognitive demands of the job in question.//\n\nFCEs can be performed on a one-on-one basis with an FCE technician along with the evaluator and may range in length from 4 to 6 hours. The FCE may take place over 2 consecutive days.//\n\nReferral and Payment for FCEs//\nPeople are generally referred for an FCE by physicians, physician assistants, and nurse practitioners; insurance representatives; case managers; employers, human resources personnel, and risk managers; attorneys (for either the plaintiff or defense); other therapists; or chiropractors. Individuals can also self-refer in states that allow direct access to occupational therapy services, but a referral may be required for reimbursement.//\n\nFCEs are paid for by workers' compensation insurance plans; self-insured plans; individual insurance plans; federal, state, and/or local agencies; managed care plans; individuals themselves, employers, or legal firms.//\n\nRates can and do change based on geography and overall evaluation time. Precertification of the service and verification of the state fee schedule or reimbursement policy is advised.//\nWhat is a Post Offer Employment Testing (POET)?]]//\nA Post-Offer Employment Test (POET) is a physical assessment given to a prospective employee after a formal job offer has been made by the employer. In order to be hired, the candidate must pass the physical assessment, which tests whether he or she can perform the physical demands of the job in a safe manner."
}
